Autodesk.Revit.DB.ExternalService.ExternalServiceRegistry.ExecuteService(System.Guid,System.Guid,Autodesk.Revit.DB.ExternalService.IExternalData)
Execute the service by the given server.
Remarks:
Execution of a service should be invoked only by the application
that registered the service. The execution will use the given server.
The serverId must be of a valid server that is currently registered for the service, ArgumentException
be thrown if it is not available.
Because this method executes an explicitly specified server regardless of what other servers are
currently active, it can only be invoked for a service that is not set as being recordable.
Plese also note that this method does not have any effect on active servers currently set for the service.
executionKey:
Access key of the service to be executed.
The key is not the same as the service's Id. It is the value
that was returned to the caller who registered the service.
serverId:
the specific server to execute
data:
The associated data. The type must be of the class defined by the service.
Returns:
The result of executing the external service.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The execution key is either invalid or of a service that is not registered.
To execute a service, the key returned by RegisterService method must be used.
-or-
The execution key is of a service that is already being executed.
-or-
The serverId is either invalid or or the server not registered to the service.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The service is recordable. This method is intended for executing of non-recordable service.
-or-
The service provider is not available.
Since:
2013

Autodesk.Revit.DB.ExternalService.ExternalServiceRegistry.RegisterService(Autodesk.Revit.DB.ExternalService.ISingleServerService,System.Guid,Autodesk.Revit.DB.ExternalService.ExternalServiceOptions)
A method to register a mandatory, single-server service.
Remarks:
Each service can only be registered once. Revit checks the Id of every service
getting registered and throws an exception upon an attempt to register a service
with an Id that already exists.
Services need to be registered before Revit ends its initialization.
For external applications that means they have to register their services
during OnStartup. This will give servers which need to register to services
a chance to do so during the ApplicationInitialized event, which is raised
after a successfully processing OnStartup routines.
A service can be registered as either recordable or non-recordable.
It is expected that a service that is once registered as recordable
will always be registered as recordable. Failure to comply with this
policy may lead to data loss in some documents when they are opened
in a Revit session with the service currently registered as non-recordable.
A service is supposed to be executed only by the application that registered
it. To enforce this requirement, the registering method return an execution
key (a Guid) that is required as an argument to ExecuteService methods.
If the owner of a service allows executing it by anyone, it needs to register
it as a public service (via the option argument). Once registered as public,
The access key of the service can be obtained by any application, thus
it can also be executed by any application. By default, a service is registered
as private.
service:
An instance of the external service class that implements ISingleServerService interface.
defaultServerId:
Id of the server that will become the service's default server (once the server is registered).
options:
Optional settings to control the service's behavior.
Returns:
An access key to the service. The key is needed to execute the service.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given service is not a valid implementation of ISingleServerService.
-or-
The given service does not return valid values from the interface methods.
At least one of the Name, VendorId, Description, and ServiceId is either empty or invalid.
-or-
A service with this Id is either invalid or not unique.
-or-
The given Id is not a valid GUID value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Service cannot be registered because the registry of services has been already closed.
All external services must be registered before the ApplicationInitialized event is raised.
Since:
2014